// Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа

// Считываем число с помощью prompt
// let number = prompt("Введите число:");

// // Вычисляем 10% от введенного числа
// let result = number * 0.1;

// // Выводим результат в консоль
// console.log("10% от числа " + number + " равно " + result);

// ==============================//

// Написать программу, которая получает два числа и выводит наименьшее

// let num1=prompt("Введите первое число:");
// let num2=prompt("Введите второе число:");

// if (num1<num2) {
//     console.log(num1);
// } else {
//     console.log(num20);
// }

// ==============================//

// Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’

// let number = prompt("Введите число:");

// if (number<100) {
//     console.log("Число меньше 100");
// } else if (number < 100) {
//     console.log("Число большее 100");
// } else {
//     console.log("Число равно 100");
// }

// ==============================//

// Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.


// let name = prompt("Введите ваше имя: ");
// let age = prompt("Введите ваш возраст: ");

// if (age >= 18) {
//   console.log(`Hello, ${name}!`);
// } else {
//   console.log(`Hi, ${name}!`);
// }